results/1/server1/scotty-0.9.0/AFTER_DEEP.log
Benchmarking AFTER_DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   163.39ms  826.10ms   8.35s    98.83%
    Req/Sec     4.79k     1.06k   12.00k    88.40%
  283371 requests in 30.00s, 40.27MB read
  Socket errors: connect 0, read 76, write 0, timeout 433
Requests/sec:   9445.71
Transfer/sec:      1.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   595.00ms    1.84s    7.94s    92.48%
    Req/Sec     4.88k     2.30k   20.79k    68.84%
  285582 requests in 30.00s, 40.58MB read
  Socket errors: connect 0, read 63, write 0, timeout 601
Requests/sec:   9518.97
Transfer/sec:      1.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   360.74ms    1.40s    7.71s    95.91%
    Req/Sec     4.83k     2.02k   19.64k    71.26%
  283542 requests in 30.01s, 40.29MB read
  Socket errors: connect 0, read 67, write 0, timeout 670
Requests/sec:   9448.83
Transfer/sec:      1.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   161.65ms  552.47ms   3.72s    97.44%
    Req/Sec     4.87k     1.63k   18.04k    88.17%
  285798 requests in 30.00s, 40.61MB read
  Socket errors: connect 0, read 90, write 0, timeout 739
Requests/sec:   9526.36
Transfer/sec:      1.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   182.32ms  643.13ms   4.85s    96.97%
    Req/Sec     4.83k     1.67k   19.38k    81.94%
  283578 requests in 30.00s, 40.30MB read
  Socket errors: connect 0, read 172, write 0, timeout 940
Requests/sec:   9452.54
Transfer/sec:      1.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   236.15ms  863.89ms   5.43s    96.50%
    Req/Sec     4.84k     1.79k   20.33k    82.39%
  283831 requests in 30.00s, 40.33MB read
  Socket errors: connect 0, read 85, write 0, timeout 617
Requests/sec:   9461.00
Transfer/sec:      1.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   282.53ms  854.04ms   4.04s    94.28%
    Req/Sec     4.88k     2.08k   20.91k    81.66%
  285778 requests in 30.00s, 40.61MB read
  Socket errors: connect 0, read 145, write 0, timeout 707
Requests/sec:   9525.69
Transfer/sec:      1.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   246.35ms    1.10s    8.33s    97.29%
    Req/Sec     4.84k     1.61k   20.17k    85.31%
  284255 requests in 30.00s, 40.39MB read
  Socket errors: connect 0, read 87, write 0, timeout 570
Requests/sec:   9474.90
Transfer/sec:      1.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   234.78ms  767.54ms   4.65s    95.72%
    Req/Sec     4.86k     2.02k   19.11k    80.08%
  284451 requests in 30.00s, 40.42MB read
  Socket errors: connect 0, read 107, write 0, timeout 626
Requests/sec:   9481.65
Transfer/sec:      1.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   224.71ms  783.47ms   4.98s    96.21%
    Req/Sec     4.84k     1.87k   18.30k    76.24%
  284139 requests in 30.00s, 40.38MB read
  Socket errors: connect 0, read 201, write 0, timeout 443
Requests/sec:   9470.75
Transfer/sec:      1.35MB
=================== summary ===================
machine:      server1
ghc version:  7.8.3
bench target: scotty-0.9.0
bench:        AFTER_DEEP
bench mode:   30s * 10
average:      9480.64
stdev:        31.85
=================== oneline ===================
server1,7.8.3,scotty-0.9.0,AFTER_DEEP,30s,10,9480.64,31.85