results/1/server1/scotty-0.9.0/HELLO.log
Benchmarking HELLO
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.62ms   20.48ms   1.69s    99.71%
    Req/Sec    15.08k     2.41k   28.24k    64.82%
  879654 requests in 30.01s, 108.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 217
Requests/sec:  29315.07
Transfer/sec:      3.61MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.83ms   28.86ms   2.39s    99.84%
    Req/Sec    15.20k     2.11k   26.03k    71.60%
  891045 requests in 30.00s, 109.62MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:  29701.57
Transfer/sec:      3.65MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    89.70ms  304.96ms   2.06s    95.18%
    Req/Sec    15.34k     7.46k   36.36k    59.64%
  878734 requests in 30.00s, 108.11MB read
  Socket errors: connect 0, read 0, write 0, timeout 412
Requests/sec:  29290.26
Transfer/sec:      3.60MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.67ms   15.85ms   1.31s    98.99%
    Req/Sec    15.07k     2.16k   25.24k    66.77%
  881702 requests in 30.00s, 108.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 614
Requests/sec:  29389.19
Transfer/sec:      3.62MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.14ms   19.60ms   1.60s    99.62%
    Req/Sec    15.03k     2.13k   27.11k    73.33%
  880740 requests in 30.00s, 108.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 89
Requests/sec:  29357.87
Transfer/sec:      3.61MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.23ms   13.31ms   1.53s    99.09%
    Req/Sec    14.70k     1.78k   22.90k    66.60%
  863283 requests in 30.00s, 106.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 194
Requests/sec:  28776.30
Transfer/sec:      3.54MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.07ms  337.15ms   2.49s    97.44%
    Req/Sec    15.52k     6.58k   38.36k    61.36%
  889297 requests in 30.00s, 109.40MB read
  Socket errors: connect 0, read 32, write 0, timeout 153
Requests/sec:  29643.02
Transfer/sec:      3.65MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.38ms   29.63ms   2.43s    99.85%
    Req/Sec    14.99k     2.25k   26.31k    71.45%
  878277 requests in 30.00s, 108.05MB read
Requests/sec:  29276.25
Transfer/sec:      3.60MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.99ms   13.89ms   1.09s    97.10%
    Req/Sec    15.01k     2.12k   25.21k    66.99%
  877994 requests in 30.00s, 108.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 545
Requests/sec:  29266.28
Transfer/sec:      3.60MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.78ms   21.04ms   2.02s    99.76%
    Req/Sec    14.66k     2.16k   25.76k    74.17%
  861999 requests in 30.00s, 106.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 41
Requests/sec:  28733.49
Transfer/sec:      3.53MB
=================== summary ===================
machine:      server1
ghc version:  7.8.3
bench target: scotty-0.9.0
bench:        HELLO
bench mode:   30s * 10
average:      29274.93
stdev:        312.90
=================== oneline ===================
server1,7.8.3,scotty-0.9.0,HELLO,30s,10,29274.93,312.90